9/data/attachments/a4a3756d725fbb5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Richard_suggest_Friend_31196_3</nif:username>
            <nif:friendToBeRequested>soap_friends_11560b34-72e6-4322-987c-642c340e8bae</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>